'=============='                                 'ИНКАПСУЛЯЦИЯ'

'''
Это принцип ооп в котором все методы и аттрибуты заключены в одном классе
существуют 3 наличие доступа:
public
_protected
__private


Декоратор @property в Python превращает метод в свойство, позволяя обращаться к нему как к обычному атрибуту. Он также позволяет создавать геттеры, сеттеры и делитеры для управления доступом и изменением значения атрибута класса.


обойти можно с 3 наличиеми доступа public protected private







'''